# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
a = [2, 4, 6, 8, 10]
b = [1, 3, 5, 7, 9]

c = [a_i + b_i for a_i, b_i in zip(a, b)]
d = [a_i - b_i for a_i, b_i in zip(a, b)]
e = [a_i * b_i for a_i, b_i in zip(a, b)]
f = [round((a_i / b_i),2) for a_i, b_i in zip(a, b)]
print(c)
print('\n')
print(d)
print('\n')
print(e)
print('\n')
print(f)

[3, 7, 11, 15, 19]


[1, 1, 1, 1, 1]


[2, 12, 30, 56, 90]


[2.0, 1.33, 1.2, 1.14, 1.11]

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [2]:
import pandas as pd
input_dict = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
output = pd.Series(input_dict)
output

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [3]:
d = {'value': [100, 200, 'pyton', 300.12, 400]}
df = pd.DataFrame(data=d)
pd.to_numeric(df.value, errors = 'coerce')

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
Name: value, dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [4]:
d = {'col1': [1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]}
df = pd.DataFrame(data=d)
a = df.col1
print(a)
type(a)

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

pandas.core.series.Series

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [5]:
d = {'col1': [1,2,3,4,5,6,7,8,9,10]}
df = pd.Series(data=d)
from statistics import mean, stdev
print('mean of the given series is', mean(df['col1']))
print('standard deviation of the given series is', round(stdev(df['col1']),2))

mean of the given series is 5.5
standard deviation of the given series is 3.03

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [6]:
import numpy as np
import pandas as pd
d = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],\
     'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
     'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
     'qualify': [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
df = pd.DataFrame(data=d)
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
df.index = labels
columns = ['attempts', 'name', 'qualify', 'score']
df = df[columns]
df.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [7]:
exam_data = {'name': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],\
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
df = pd.DataFrame(data=exam_data)
labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
df.index = labels
df

          name  score  attempts qualify
a    Anastasia   12.5         1     yes
 b        Dima    9.0         3      no
 c   Katherine   16.5         2     yes
 d       James    NaN         3      no
 e       Emily    9.0         2      no
 f     Michael   20.0         3     yes
 g     Matthew   14.5         1     yes
h        Laura    NaN         1      no
i        Kevin    8.0         2      no
j        Jonas   19.0         1     yes

In [8]:
df= df.loc[[ ' b ', ' e ',  ' g ', 'h', 'j'],['name', 'score']]
df

        name  score
 b      Dima    9.0
 e     Emily    9.0
 g   Matthew   14.5
h      Laura    NaN
j      Jonas   19.0

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [9]:
exam_data = {'name': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],\
             'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],\
             'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
             'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
df = pd.DataFrame(data=exam_data)
labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
df.index = labels
# df = df.groupby('name')['score'].mean().reset_index()
mean_score = df.score.mean()
mean_score

13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [10]:
d = {'col1': [1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]}
df = pd.DataFrame(data=d)

In [11]:
df = df.rename(columns= {'col1':'Column1', 'col2':'Column2', 'col3':'Column3'})
df

   Column1  Column2  Column3
0        1        4        7
1        2        5        5
2        3        6        8
3        4        9       12
4        7        5        1
5       11        0       11

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [12]:
d = {'city': ['Los Angeles', 'California', 'Georgia', 'California','Los Angeles','Georgia', 'California'],\
     'number_of_people':[4,2,4,1,2,3,5]}
df = pd.DataFrame(data=d)
df

          city  number_of_people
0  Los Angeles                 4
1   California                 2
2      Georgia                 4
3   California                 1
4  Los Angeles                 2
5      Georgia                 3
6   California                 5

In [13]:
df = df.groupby('city')['number_of_people'].sum()
df

city
California     8
Georgia        7
Los Angeles    6
Name: number_of_people, dtype: int64

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [14]:
import pandas as pd
# pd.set_option('display.height', 1000)
# pd.set_option('display.max_rows', 500)
# pd.set_option('display.max_columns', 500)
pd.set_option('display.width', 1200)

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [15]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'] * 3)
pd.to_datetime(s, infer_datetime_format=True)

0   2000-03-11
1   2000-03-12
2   2000-03-13
3   2000-03-11
4   2000-03-12
5   2000-03-13
6   2000-03-11
7   2000-03-12
8   2000-03-13
dtype: datetime64[ns]

Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [16]:
column_names = ["a", "b", "c"]
df_1 = pd.DataFrame(columns = column_names)
print(df_1)

Empty DataFrame
Columns: [a, b, c]
Index: []

In [17]:
d = {'col1': [1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]}
df = pd.DataFrame(data=d)

In [18]:
df_1 = df_1.append(df)
df_1

     a    b    c  col1  col2  col3
0  NaN  NaN  NaN   1.0   4.0   7.0
1  NaN  NaN  NaN   2.0   5.0   5.0
2  NaN  NaN  NaN   3.0   6.0   8.0
3  NaN  NaN  NaN   4.0   9.0  12.0
4  NaN  NaN  NaN   7.0   5.0   1.0
5  NaN  NaN  NaN  11.0   0.0  11.0

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [19]:
d = {'col1': [1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11], 'col4':[6,5,8,12,1,11]}
df = pd.DataFrame(data=d)
print('the number of columns in the given dataframe is-', len(df.columns))

the number of columns in the given dataframe is- 4

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [20]:
d = {'col1': [1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11], 'col4':[6,5,8,12,1,11]}
df = pd.DataFrame(data=d)
indexes = df.tail(3).index
df = df.drop(indexes)
df

   col1  col2  col3  col4
0     1     4     7     6
1     2     5     5     5
2     3     6     8     8

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [21]:
# ! pip install xlrd

In [22]:
coal_public = pd.read_excel('coalpublic2013.xlsx')
coal_public.head()

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [23]:
coal_public = pd.read_excel('coalpublic2013.xlsx')
coal_public.loc[coal_public.Mine_Name.str.startswith('P', na=False)]
# coal_public_p = coal_public[coal_public['Mine_Name'][0] == 'P']
# coal_public_p

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

In [24]:
len(coal_public.loc[coal_public.Mine_Name.str.startswith('P', na=False)])

4

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [25]:
employee = pd.read_excel('employee.xlsx')
employee = employee[employee['hire_date'] > '01-01-07']
employee

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [26]:
employee = pd.read_excel('employee.xlsx')
employee_list = employee[employee['hire_date'] == '2003-06-17']
employee_list

   emp_id first_name last_name  hire_date
0     100     Steven      King 2003-06-17

## Great Job!